# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\tyork\Documents\PSoC Creator\ECE381_SP23_Lab08_FreeRTOS\Design01.cydsn\Design01.cyprj
# Date: Thu, 13 Apr 2023 15:59:45 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 541.66666666666663 -waveform {0 270.833333333333} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 27 53} -nominal_period 541.66666666666663 [list]


# Component constraints for C:\Users\tyork\Documents\PSoC Creator\ECE381_SP23_Lab08_FreeRTOS\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\tyork\Documents\PSoC Creator\ECE381_SP23_Lab08_FreeRTOS\Design01.cydsn\Design01.cyprj
# Date: Thu, 13 Apr 2023 15:59:43 GMT
