# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Hello Kitty\Desktop\MicrocontrollersLab\Lab 6 - SPI Wireless LEDs\Project\ECE381_SP23_Lab06_Wirless_Light_Controller.cydsn\ECE381_SP23_Lab06_Wirless_Light_Controller.cyprj
# Date: Wed, 22 Mar 2023 01:16:57 GMT
#set_units -time ns
create_clock -name {PWM_CLK(FFB)} -period 100000 -waveform {0 50000} [list [get_pins {ClockBlock/ff_div_11}]]
create_clock -name {SPI_SCBCLK(FFB)} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {PWM_CLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 4801 9601} [list]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]


# Component constraints for C:\Users\Hello Kitty\Desktop\MicrocontrollersLab\Lab 6 - SPI Wireless LEDs\Project\ECE381_SP23_Lab06_Wirless_Light_Controller.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Hello Kitty\Desktop\MicrocontrollersLab\Lab 6 - SPI Wireless LEDs\Project\ECE381_SP23_Lab06_Wirless_Light_Controller.cydsn\ECE381_SP23_Lab06_Wirless_Light_Controller.cyprj
# Date: Wed, 22 Mar 2023 01:16:53 GMT
